appbench/leveldb/ycsb/results/nova/RunD/run1
LevelDB:    version 1.18
Date:       Fri May  7 06:51:37 2021
CPU:        64 * Intel(R) Xeon(R) Gold 5218 CPU @ 2.30GHz
CPUCache:   22528 KB
Thread 0: Parsing trace ...
Thread 0: Done parsing, 500000 operations.
Thread 0: Replaying trace ...

... finished 500000 ops                              

Thread 0: Done replaying 500000 operations.
YCSB splitup: R = 475231, D = 0, I = 24769, U = 0, S = 0
LevelDB/WiscKey splitup: P = 24769, G = 475231, D = 0, ItSeek = 0, ItNext = 0
Thread 0: Time taken = 1.544 seconds
Thread 0: Total data: YCSB = 0.502016 GB, HyperLevelDB = 0.502016 GB
Thread 0: Ops/s = 316.146 Kops/s
Thread 0: YCSB throughput = 332.840111 MB/s
Thread 0: HyperLevelDB throughput = 332.840111 MB/s
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1000000
RawSize:    110.6 MB (estimated)
FileSize:   62.9 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0         0        0        26
  1        7       10         0       90        84
  2       64      101         1      326       321
  3      263      522         1      290       264

ycsb         :       3.410 micros/op;